{
  "amazon": [
    "I bought this phone because I needed a 5g phone, happy with the purchase,  awesome sound, awesome camera pictures quality,  overall an excellent phone, I use the phone moderately and did not face any heating or another kind of  problem,  I am 100 percent satisfied with the purchase , Thank You \nWhy did you pick this product vs others?:\nI picked this product because of Samsung brand and for Decent number of OS and security updates , bought a fast charger and it charges to full in 1.5 hours, for my moderate use the charging lasts 2 days which I am satisfied \nFingerprint sensor:\nLove the fingerprint sensor\nPhone hangs:\nDid not face phone hanging problem \nDurability:\nLooks very durable to ne\nPhone functionality:\nAs stated camera and sound quality are remarkably excellent \n\nOverall fully satisfied \n\nWill definitely recommend this phone to those I know",
    "Pros:\n- Great battery backup. With moderate usage on WiFi, can easily last upto 2 days. Also, there is very less battery drain when idle, especially overnight. Definitely one of the best with 6000 mAh. One of my primary reasons to buy this phone.\n- Camera quality at this price is way above average.\n- Finally, punch hole display from Samsung for M series and at this price point.\n- One UI software is very stable and comes with plenty of customisations.\n- No issues in performance with multitasking involving streaming videos, music, social media apps, browser surfing, etc. Can't say about gaming as I am not a gamer.\n- Up to 4 gens of software updates which hardly any company provides even with flagship phones. But need to keep in mind that the product page on Samsung's website clearly states that this is not a promise but just their current plans, and it can be changed anytime at their own discretion.\n\nCons:\n- Bulky (which is expected considering the massive battery), holding with one hand for extended period of time causes discomfort, specially if you are used to phones weighing below 175g.\n- Headphone jack missing. Considering the thickness of the phone, this could easily have been accommodated.\n- Phone does not come with any IP rating which is surprising, so any contact with water might potentially cause damage.\n- There is a noticeable battery drain with 5G network, but could be improved in future software updates.\n- Not specific to this phone but with all Samsung phones: Missing charging adaptor, back cover, and screen protector. So, need to shell out extra money for these.",
    "Bought this phone with a bit of trepidation because 3 of the 7 Samsung phones I have bought prior to this one - either for myself or family - have developed a screen issue, Although only one was serious enough to require a visit to the service center. Thought of switching to a different company but seeing as all of them usually end up with some issue or the other, and the ratings of most of them end up around 4 stars anyway, I decided to stick with the known devil. And besides the display issue, most have served for a good time, including its ancestor, the M30, that this will replace. That too developed a screen issue but it was after 4 years of use so not complaining too much.\n\nInitial impressions so far has been decent. They have finally got rid of the water drop notch and gone with the punch hole in the M3x series, so that is good, it looks nicer. Even the overall design has been upgraded to bring it closer to the flagship S series with the flat sides and no camera island. No sharp edges either, so it is not uncomfortable to hold... except for the weight.\n\nSamsung phones, particularly the non flagship ones, are heavier than they should be for some reason (comparing to similarly spec'd phones by other companies), And this one is on the heavier side even among those at 222g. My primary phone too is heavy (not Samsung) so I am used to it, but I would nonetheless like a lighter phone. My father's M52 which has a 5000mah battery is 50g lighter and so much more comfortable in the hand and the pocket.\n\nIf you add a case and a screen protector, the weight will increase even further so note that. The 6000mah battery however does its job and the phone is lasting me 1.5 - 2 days between charge. I'm not a heavy user though, no gaming or constant camera usage and such so your mileage may vary.\n\nI like the fingerprint sensor in the power button, very responsive. Better than the in display type I think. It supports sd card (hybrid sim - sd card) so that's good. The base 128gb model should be enough because of this, can upgrade storage with an sd card when needed.\n\nThey have dropped the audio jack, but I have moved on to wireless so not a concern for me but I know there are die hard fans. A related drawback though is that FM radios are no longer possible since they need a wired earphone to act as antenna. I didnt use it too frequently but it was nice to have for those rare occasions.\n\nNot much of a camera guy so cant comment on how good or bad it is. Didn't notice any slowness or other issues, works well enough for my basic needs. No heating either - it was slightly warm during charging which is normal and again a little bit during video recording and the like, but that was barely so, less than during charging. I dont really do too many heavy processing type tasks, or even gaming.\n\nFor regular needs this phone should be fine I think. If it stays this way for a few years I think I will be happy with this phone. On paper it seems to be a good phone at a decent price. I took a gamble by buying it soon after launch, without waiting for reviews. I havent noticed any drawbacks so far and hopefully it wont give me any reason to regret later on. Fingers crossed. Giving it 5 stars for now, will update if anything happens.",
    "Feel cheated\nSamsung m35 is a great phone, work wonderful.\nBut I am being cheated by Amazon, a loyal customer of Amazon for a decade.\nThe current product is offered to me at 16999/-, i without any second thought purchased it.\nBut when one of my friend check the same phone within few days, it was offered to him at 13499/-, a discount of 3500, that huge.\nThis is the way Amazon operate, i\nAs I use only Amazon they start charging me extra, a great reward for a loyal customer.\nThank you Amazon",
    "Cellulare molto bello .",
    "",
    "Good Products",
    "Pros,\nIt is unlocked and working in Saudi Arabia, Good display, large battery, good sound, best phone for the price, NFC working in KSA\n\nCons,\nWeight and bulky, taking 2hr to full charge because large battery and 25w charging, no water/dust protection.\n\nFinally : worth for the price,",
    "I appreciated the great communication from the seller throughout the order process, ensuring everything went smoothly.\n\nthe item Samsung Galaxy M35 5G (Thunder Grey,6GB RAM,128GB Storage) is original genuine product.\nThe packaging was secure, and the item was in perfect condition upon arrival. I highly recommend the seller Techorbit Trading LLC for their exceptional service and quality products.",
    "Highly recommended"
  ]
}